InformationRegisters/ДистанционнаяРаботаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДистанционнаяРаботаСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РаботаетДистанционно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимДистанционнойРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыДистанционнойРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ДистанционнаяРабота/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дистанционная работа"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	// ЗУПК - обновление на 3.1.1.81 в подсистеме ЗУПК
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия = "3.1.14.150";
	//Обработчик.РежимВыполнения = "Отложенно";
	//Обработчик.Процедура = "ДистанционнаяРабота.ЗаполнитьДистанционнуюРаботуСотрудников";
	//Обработчик.Идентификатор = Новый УникальныйИдентификатор("d3e990e9-e111-494e-9b49-5622b9e0a2e8");
	//Обработчик.Комментарий = НСтр("ru = 'Заполнение дистанционной работы сотрудников для контроля самочувствия.'");
	// ЗУПК
	
КонецПроцедуры

Процедура ЗаполнитьДистанционнуюРаботуСотрудников(ПараметрыОбновления = Неопределено) Экспорт
	
	// ЗУПК
	Возврат;
 
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	// Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудников
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудников;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудниковИнтервальный;
	
КонецПроцедуры

Процедура ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления) Экспорт
	
	РегистрыСведений.ДистанционнаяРаботаСотрудников.ЗаполнитьИнтервальныйРегистр(ПараметрыОбновления);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокументов

Процедура ДобавитьКомандыПечатиПереводаНаДистанционнуюРаботу(КомандыПечати, ЭтоКадровыйПеревод = Ложь) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоКадровыйПеревод Тогда
		ДобавитьКомандуПечатиДопСоглашенияКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу(КомандыПечати);
	КонецЕсли;
	
	ДобавитьКомандуПечатиЗаявленияОПереводеНаДистанционнуюРаботу(КомандыПечати, ЭтоКадровыйПеревод);
	
КонецПроцедуры

Процедура ДобавитьУсловиеВидимостиКоманды(КомандаПечати, ЗначениеУсловия, ИмяУсловия = "РаботаетДистанционно") Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, ИмяУсловия, ЗначениеУсловия);
	
КонецПроцедуры

#КонецОбласти

#Область РассылкаДокументов

Процедура ДобавитьКомандыРассылки(Команды) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, "ПриемНаРаботу");
	ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, "ПриемНаРаботуСписком");
	ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, "КадровыйПеревод", Истина);
	ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, "КадровыйПереводСписком", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область КадровыеДанныеСотрудников

Функция ДобавитьПолеСведенийОДистанционнойРаботеСотрудников(ИмяПоля, ТекстыОписанияПолей, ИсточникиДанных) Экспорт
	
	ДобавленоПолеСведений = Ложь;
	Если НеобходимыСведенияОДистанционнойРаботеСотрудников(ИмяПоля) Тогда
		
		ДобавленоПолеСведений = Истина;
		ИсточникиДанных.Вставить("СведенияОДистанционнойРаботеСотрудников", Истина);
		
		ПутьКДанным = ПутьКДаннымСведенийОДистанционнойРаботеСотрудников(ИмяПоля);
		ТекстыОписанияПолей.Добавить(ПутьКДанным + " КАК " + ИмяПоля);
		
	КонецЕсли;
	
	Возврат ДобавленоПолеСведений;
	
КонецФункции

Функция ДобавитьКритерийПоискаПоСведениямОДистанционнойРаботеСотрудников(КритерииПоиска, УсловиеПоиска) Экспорт
	
	КритерийДобавлен = Ложь;
	Если НеобходимыСведенияОДистанционнойРаботеСотрудников(УсловиеПоиска.ЛевоеЗначение) Тогда
		
		ИмяПоля = ВРег(УсловиеПоиска.ЛевоеЗначение);
		Если ИмяПоля = ВРег("РаботаетДистанционноПериодРегистрации")
			Или ИмяПоля = ВРег("РежимДистанционнойРаботыПериодРегистрации") Тогда
			УсловиеПоиска.ЛевоеЗначение = "Период";
		ИначеЕсли ИмяПоля = ВРег("РаботаетДистанционноРегистратор")
			Или ИмяПоля = ВРег("РежимДистанционнойРаботыРегистратор") Тогда
			УсловиеПоиска.ЛевоеЗначение = "Регистратор";
		КонецЕсли;
		
		КадровыйУчет.ДобавитьКритерийПоискаСотрудников(КритерииПоиска, "РегистрСведений.ДистанционнаяРаботаСотрудников", УсловиеПоиска);
		КритерийДобавлен = Истина;
		
	КонецЕсли; 
	
	Возврат КритерийДобавлен;
	
КонецФункции

Процедура ЗаполнитьПоляПредставленийКадровыхДанныхСотрудников(ДополнительныеПоляПредставлений, ПутьКПолямСотрудника) Экспорт
	
	ОписаниеПоля = ДополнительныеПоляПредставлений.Добавить();
	ОписаниеПоля.ИмяПоля = "РаботаетДистанционно";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЛОЖЬ";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".РаботаетДистанционно";
	
	ОписаниеПоля = ДополнительныеПоляПредставлений.Добавить();
	ОписаниеПоля.ИмяПоля = "РаботаетДистанционноПериодРегистрации";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ДАТАВРЕМЯ(1, 1, 1)";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".РаботаетДистанционноДатаРегистрации";
	
	ОписаниеПоля = ДополнительныеПоляПредставлений.Добавить();
	ОписаниеПоля.ИмяПоля = "РежимДистанционнойРаботы";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЛОЖЬ";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".РежимДистанционнойРаботы";
	
	ОписаниеПоля = ДополнительныеПоляПредставлений.Добавить();
	ОписаниеПоля.ИмяПоля = "РежимДистанционнойРаботыПериодРегистрации";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ДАТАВРЕМЯ(1, 1, 1)";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".РежимДистанционнойРаботыДатаРегистрации";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВТСведенияОДистанционнойРаботеСотрудников(Запрос, ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень, ИсточникиДанных) Экспорт
	
	Если ИсточникиДанных.Получить("СведенияОДистанционнойРаботеСотрудников") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросВТ = ЗапросВТСведенияОДистанционнойРаботеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СкопироватьПараметрыЗапроса(Запрос, ЗапросВТ);
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(ЗапросВТ.Текст);
	ЧастиЗапроса.Добавить(ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов());
	ЧастиЗапроса.Добавить(Запрос.Текст);
	
	ЧастиЗапроса.Добавить(
		"		{ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДистанционнойРаботеСотрудников КАК СведенияОДистанционнойРаботеСотрудников
		|		ПО ТаблицаОтборов." + ОписательВременнойТаблицыОтборов.ИмяПоляСотрудник + " = СведенияОДистанционнойРаботеСотрудников.Сотрудник
		|			И ТаблицаОтборов." + ОписательВременнойТаблицыОтборов.ИмяПоляПериод + " = СведенияОДистанционнойРаботеСотрудников.Период}");
	
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС);
	
	КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "ВТКУничтожению", "ВТСведенияОДистанционнойРаботеСотрудников");
	
КонецПроцедуры

Процедура ДобавитьПризнакДистанционнойРаботыВЗапросНабораДанныхПечатнойФормыТ1(ОбъектОтчета) Экспорт
	
	Для Каждого НаборДанных Из ОбъектОтчета.СхемаКомпоновкиДанных.НаборыДанных Цикл
		Если ТипЗнч(НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			Если СтрНайти(НаборДанных.Запрос, "Представления_КадровыеДанныеСотрудников") = 0 Тогда
				Продолжить;
			КонецЕсли;
			СхемаЗапроса = Новый СхемаЗапроса;
			СхемаЗапроса.УстановитьТекстЗапроса(НаборДанных.Запрос);
			
			ДобавитьПолеЗапроса(СхемаЗапроса, "Представления_КадровыеДанныеСотрудников", "ЛОЖЬ", "РаботаетДистанционно");
			// ЗУПК
			ДобавитьПолеЗапроса(СхемаЗапроса, "Представления_КадровыеДанныеСотрудников", "ЗНАЧЕНИЕ(Перечисление.РежимыДистанционнойРаботы.ПустаяСсылка)", "РежимДистанционнойРаботы");
			// ЗУПК
			
			НаборДанных.Запрос = СхемаЗапроса.ПолучитьТекстЗапроса();
			НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "НЕОПРЕДЕЛЕНО КАК РаботаетДистанционно",
				"Представления_КадровыеДанныеСотрудников.РаботаетДистанционно КАК РаботаетДистанционно");
			// ЗУПК
			НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "НЕОПРЕДЕЛЕНО КАК РежимДистанционнойРаботы",
				"Представления_КадровыеДанныеСотрудников.РежимДистанционнойРаботы КАК РежимДистанционнойРаботы");
			// ЗУПК
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПризнакДистанционнойРаботыВЗапросНабораДанныхПечатнойФормыТ5(ОбъектОтчета) Экспорт
	
	Для Каждого НаборДанных Из ОбъектОтчета.СхемаКомпоновкиДанных.НаборыДанных Цикл
		Если ТипЗнч(НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			Если СтрНайти(НаборДанных.Запрос, "Представления_КадровыеДанныеСотрудников") = 0 Тогда
				Продолжить;
			КонецЕсли;
			СхемаЗапроса = Новый СхемаЗапроса;
			СхемаЗапроса.УстановитьТекстЗапроса(НаборДанных.Запрос);
			
			ПервыйЗапросПакета = СхемаЗапроса.ПакетЗапросов[0];
			Для Каждого Оператор Из ПервыйЗапросПакета.Операторы Цикл
				ПервыйИсточник = Оператор.Источники[0];
				ПсевдонимПервогоИсточника = ПервыйИсточник.Источник.Псевдоним;
				
				Если ПсевдонимПервогоИсточника = "ПеремещениеВДругоеПодразделениеСотрудники" Тогда
					Продолжить;
				КонецЕсли;
				
				ДистанционнаяРаботаСотрудников = Оператор.Источники.Добавить("РегистрСведений.ДистанционнаяРаботаСотрудников", "ДистанционнаяРаботаСотрудников");
				ДистанционнаяРаботаСотрудников.Соединения.Очистить();
				
				УсловиеСоединения = ПсевдонимПервогоИсточника + ".Ссылка = ДистанционнаяРаботаСотрудников.Регистратор";
				ПервыйИсточник.Соединения.Добавить(ДистанционнаяРаботаСотрудников.Источник.Псевдоним, УсловиеСоединения);
				УсловиеСоединения = ПсевдонимПервогоИсточника + ".Сотрудник = ДистанционнаяРаботаСотрудников.Сотрудник";
				ПервыйИсточник.Соединения.Добавить(ДистанционнаяРаботаСотрудников.Источник.Псевдоним, УсловиеСоединения);
				УсловиеСоединения = ПсевдонимПервогоИсточника + ".ДатаНачала = НАЧАЛОПЕРИОДА(ДистанционнаяРаботаСотрудников.Период, ДЕНЬ)";
				ПервыйИсточник.Соединения.Добавить(ДистанционнаяРаботаСотрудников.Источник.Псевдоним, УсловиеСоединения);
			КонецЦикла;
	
			ДобавитьПолеЗапроса(СхемаЗапроса, "Представления_КадровыеДанныеСотрудников", "ЛОЖЬ", "РаботаетДистанционно");			
			ДобавитьПолеЗапроса(СхемаЗапроса, "Представления_КадровыеДанныеСотрудников_Прежние", "ЛОЖЬ", "РаботаетДистанционно");
			// ЗУПК
			ДобавитьПолеЗапроса(СхемаЗапроса, "Представления_КадровыеДанныеСотрудников", "ЗНАЧЕНИЕ(Перечисление.РежимыДистанционнойРаботы.ПустаяСсылка)", "РежимДистанционнойРаботы");
			ДобавитьПолеЗапроса(СхемаЗапроса, "Представления_КадровыеДанныеСотрудников_Прежние", "ЗНАЧЕНИЕ(Перечисление.РежимыДистанционнойРаботы.ПустаяСсылка)", "РежимДистанционнойРаботы");
			// ЗУПК
			
			НаборДанных.Запрос = СхемаЗапроса.ПолучитьТекстЗапроса();
			
			НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "ЕСТЬNULL(КадроваяИсторияСотрудников.Период, КОНЕЦПЕРИОДА(КадровыйПеревод",
				"ЕСТЬNULL(КадроваяИсторияСотрудников.Период, ЕСТЬNULL(ДистанционнаяРаботаСотрудников.Период, КОНЕЦПЕРИОДА(КадровыйПеревод");
			НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "ДатаНачала, ДЕНЬ))", "ДатаНачала, ДЕНЬ)))");
			НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "НЕОПРЕДЕЛЕНО КАК РаботаетДистанционно,",
				"КадровыеДанныеСотрудников.РаботаетДистанционно КАК РаботаетДистанционно,");
			НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "НЕОПРЕДЕЛЕНО КАК РаботаетДистанционноПрежняя,",
				"КадровыеДанныеСотрудниковПрежние.РаботаетДистанционно КАК РаботаетДистанционноПрежняя,");
			// ЗУПК
			НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "НЕОПРЕДЕЛЕНО КАК РежимДистанционнойРаботы,",
				"КадровыеДанныеСотрудников.РежимДистанционнойРаботы КАК РежимДистанционнойРаботы,");
			НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "НЕОПРЕДЕЛЕНО КАК РежимДистанционнойРаботыПрежняя,",
				"КадровыеДанныеСотрудниковПрежние.РежимДистанционнойРаботы КАК РежимДистанционнойРаботыПрежняя,");
			// ЗУПК
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудниковИнтервальный, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СотрудникиНаДистанционнойРаботе);
	
КонецПроцедуры

#КонецОбласти

// Заполняет наборы записей регистра ДистанционнаяРаботаСотрудников.
//
// Параметры:
//		Движения - коллекция движений регистратора.
//		ДанныеДляПроведения - Структура данных для проведения документа, в которую добавляются данные по испытательному сроку.
//
Процедура СформироватьДвиженияПоДистанционнойРаботе(Движения, ДанныеДляПроведения) Экспорт
	
	Если Не ДанныеДляПроведения.Свойство("ДистанционнаяРаботаСотрудников")
		Или Не ЗначениеЗаполнено(ДанныеДляПроведения.ДистанционнаяРаботаСотрудников) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаДанныхДляПроведения Из ДанныеДляПроведения.ДистанционнаяРаботаСотрудников Цикл
		СтрокаДвижений = Движения.ДистанционнаяРаботаСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаДанныхДляПроведения);
	КонецЦикла;
	
	Если Движения.ДистанционнаяРаботаСотрудников.Количество() > 0 Тогда
		Движения.ДистанционнаяРаботаСотрудников.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает таблицу для проведения документов ПриемНаРаботу/ПриемНаРаботуСписком.
//
// Параметры:
//		ДанныеДляПроведения - Структура, в которую добавляются данные по испытательному сроку.
//		ДокументСсылка - Ссылка на документ, для которого требуется подготовить таблицу для проведения.
//
//
Процедура ПриемНаРаботуСведенияОДистанционнойРаботе(ДанныеДляПроведения, ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриемНаРаботу.ДатаПриема КАК Период,
		|	ПриемНаРаботу.Сотрудник КАК Сотрудник,
		|	ПриемНаРаботу.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ПриемНаРаботу.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПриемНаРаботу.РежимДистанционнойРаботы КАК РежимДистанционнойРаботы,
		|	ПриемНаРаботу.РаботаетДистанционно КАК РаботаетДистанционно
		|ИЗ
		|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
		|ГДЕ
		|	ПриемНаРаботу.Ссылка = &Ссылка";
	
	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗЛИЧНЫЕ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПриемНаРаботу", "Документ.ПриемНаРаботуСписком.Сотрудники");
	КонецЕсли;
	
	// Набор сведений для проведения по дистанционной работе сотрудников
	СведенияОДистанционнойРаботеСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ДистанционнаяРаботаСотрудников", СведенияОДистанционнойРаботеСотрудников);
		
КонецПроцедуры

// Подготавливает таблицу для проведения документов КадровыйПеревод/КадровыйПереводСписком.
//
// Параметры:
//		ДанныеДляПроведения - Структура, в которую добавляются данные по испытательному сроку.
//		ДокументСсылка - Ссылка на документ, для которого требуется подготовить таблицу для проведения.
//
//
Процедура КадровыйПереводСведенияОДистанционнойРаботе(ДанныеДляПроведения, ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.ДатаНачала КАК Период,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.РаботаетДистанционно КАК РаботаетДистанционно,
		|	Сотрудники.РежимДистанционнойРаботы КАК РежимДистанционнойРаботы,
		|	ВЫБОР
		|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
		|		ИНАЧЕ Сотрудники.ДатаОкончания
		|	КОНЕЦ КАК ДействуетДо
		|ИЗ
		|	Документ.КадровыйПеревод КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Ссылка
		|	И Сотрудники.ИзменитьДистанционнуюРаботу";
		
	Если ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.КадровыйПеревод") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗЛИЧНЫЕ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.КадровыйПеревод", "Документ.КадровыйПереводСписком.Сотрудники");
	КонецЕсли;
		
	// Набор сведений для проведения по дистанционной работе сотрудников
	СведенияОДистанционнойРаботеСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ДистанционнаяРаботаСотрудников", СведенияОДистанционнойРаботеСотрудников);
		
КонецПроцедуры

// Подготавливает таблицу для проведения документа НачальнаяШтатнаяРасстановка.
//
// Параметры:
//		ДанныеДляПроведения - Структура, в которую добавляются данные по испытательному сроку.
//		ДокументСсылка - Ссылка на документ, для которого требуется подготовить таблицу для проведения.
//
//
Процедура НачальнаяШтатнаяРасстановкаСведенияОДистанционнойРаботе(ДанныеДляПроведения, ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачальнаяШтатнаяРасстановка.Ссылка.Месяц КАК Период,
		|	НачальнаяШтатнаяРасстановка.Сотрудник КАК Сотрудник,
		|	НачальнаяШтатнаяРасстановка.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	НачальнаяШтатнаяРасстановка.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЛОЖЬ КАК РаботаетДистанционно
		|ИЗ
		|	Документ.НачальнаяШтатнаяРасстановка.Сотрудники КАК НачальнаяШтатнаяРасстановка
		|ГДЕ
		|	НачальнаяШтатнаяРасстановка.Ссылка = &Ссылка";
	
	// Набор сведений для проведения по дистанционной работе сотрудников
	СведенияОДистанционнойРаботеСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ДистанционнаяРаботаСотрудников", СведенияОДистанционнойРаботеСотрудников);
		
КонецПроцедуры

#КонецОбласти

#Область КадровыйЭДО

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
	// ЗУПК
	Возврат;
	// ЗУПК
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КадровыеДанныеСотрудников

Функция ЗапросВТСведенияОДистанционнойРаботеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень, ИмяВТСведенияОДистанционнойРаботеСотрудников = "ВТСведенияОДистанционнойРаботеСотрудников")
	
	ПоляОтбора = Неопределено;
	Если ПоляОтбораПериодическихДанных <> Неопределено Тогда
		ПоляОтбораПериодическихДанных.Свойство("ДистанционнаяРаботаСотрудников", ПоляОтбора);
	КонецЕсли;
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		ОписательВременнойТаблицыОтборов.ИмяВременнойТаблицыОтборовСотрудников, "Сотрудник");
	
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Период", ОписательВременнойТаблицыОтборов.ИмяПоляПериод);
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Сотрудник", ОписательВременнойТаблицыОтборов.ИмяПоляСотрудник);
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.Отборы = ПоляОтбора;
	ПараметрыПостроения.ФормироватьСПериодичностьДень = ФормироватьСПериодичностьДень;
	
	ЗапросВТИмяРегистраСрез = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ДистанционнаяРаботаСотрудников", 
		ТолькоРазрешенные,
		ОписаниеФильтра,
		ПараметрыПостроения,
		Истина,
		ИмяВТСведенияОДистанционнойРаботеСотрудников);
	
	Возврат ЗапросВТИмяРегистраСрез;
	
КонецФункции

Функция НеобходимыСведенияОДистанционнойРаботеСотрудников(Знач ИмяПоля)
	
	ИмяПоля = ВРег(ИмяПоля);
	
	Возврат ИмяПоля = ВРег("РаботаетДистанционноПериодРегистрации")
		Или ИмяПоля = ВРег("РаботаетДистанционноРегистратор")
		Или ИмяПоля = ВРег("РаботаетДистанционно")
		Или ИмяПоля = ВРег("РежимДистанционнойРаботыПериодРегистрации")
		Или ИмяПоля = ВРег("РежимДистанционнойРаботыРегистратор")
		Или ИмяПоля = ВРег("РежимДистанционнойРаботы");
		
КонецФункции

Функция ПутьКДаннымСведенийОДистанционнойРаботеСотрудников(Знач ИмяПоля)
	
	ИмяПоляВВерхнемРегистре = ВРег(ИмяПоля);
	
	ПутьКДанным = "";
	
	Если ИмяПоляВВерхнемРегистре = ВРег("РаботаетДистанционноПериодРегистрации") Тогда
		ПутьКДанным = "	СведенияОДистанционнойРаботеСотрудников.ПериодЗаписи";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("РаботаетДистанционноРегистратор") Тогда
		ПутьКДанным = "	СведенияОДистанционнойРаботеСотрудников.Регистратор";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("РаботаетДистанционно") Тогда
		ПутьКДанным = "	СведенияОДистанционнойРаботеСотрудников.РаботаетДистанционно";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("РежимДистанционнойРаботыПериодРегистрации") Тогда
		ПутьКДанным = "	СведенияОДистанционнойРаботеСотрудников.ПериодЗаписи";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("РежимДистанционнойРаботыРегистратор") Тогда
		ПутьКДанным = "	СведенияОДистанционнойРаботеСотрудников.Регистратор";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("РежимДистанционнойРаботы") Тогда
		ПутьКДанным = "	СведенияОДистанционнойРаботеСотрудников.РежимДистанционнойРаботы";
	КонецЕсли;
	
	Возврат ПутьКДанным;
	
КонецФункции

#КонецОбласти

#Область ПечатьДокументов

Процедура ДобавитьКомандуПечатиДопСоглашенияКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу(КомандыПечати)
	
	// ЗУПК
	//Если Не ПравоДоступа("Использование", Метаданные.Обработки.ПечатьДокументовДляПереводаНаДистанционнуюРаботу) Тогда
	// ЗУПК
		Возврат;
	//КонецЕсли;
	// ЗУПК
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьДокументовДляПереводаНаДистанционнуюРаботу";
	КомандаПечати.Идентификатор = "ПФ_MXL_ДопСоглашениеКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу";
	КомандаПечати.Представление = НСтр("ru = 'Доп. соглашение к трудовому договору при переводе на дистанционную работу'");
	КомандаПечати.Порядок = 120;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Истина);
	ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Истина, "ИзменитьДистанционнуюРаботу");
	
КонецПроцедуры

Процедура ДобавитьКомандуПечатиЗаявленияОПереводеНаДистанционнуюРаботу(КомандыПечати, ЭтоКадровыйПеревод)
	
	// ЗУПК
	//Если Не ПравоДоступа("Использование", Метаданные.Обработки.ПечатьДокументовДляПереводаНаДистанционнуюРаботу) Тогда
	// ЗУПК
		Возврат;
	// ЗУПК
	//КонецЕсли;
	// ЗУПК
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьДокументовДляПереводаНаДистанционнуюРаботу";
	КомандаПечати.Идентификатор = "ПФ_MXL_ЗаявлениеОПереводеНаДистанционнуюРаботу";
	КомандаПечати.Представление = НСтр("ru = 'Заявление о переводе на дистанционную работу'");
	КомандаПечати.Порядок = 130;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Истина);
	Если ЭтоКадровыйПеревод Тогда
		ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Истина, "ИзменитьДистанционнуюРаботу");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РассылкаДокументов

Процедура ДобавитьКомандуРассылкиДокументовПриПереводеНаДистанционнуюРаботу(Команды, ИмяДокумента, ЭтоКадровыйПеревод = Ложь)
	
	Возврат;
	Команда = Команды.Добавить();
	Команда.ТипПараметра = Новый ОписаниеТипов("ДокументСсылка." + ИмяДокумента);
	Команда.Представление = НСтр("ru = 'Рассылка документов для перевода на дистанционную работу'");
	//Команда.Назначение = РассылкаДокументов.ВидыНазначенияКомандыРассылки().ДляСписка;
	//Команда.РежимЗаписи = РассылкаДокументов.РежимыЗаписиОбъектаПередВыполнениемКомандыРассылки().Проводить;
	Команда.ТемаПисьма = НСтр("ru = 'Документы для перевода на дистанционную работу'");
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	Команда.ТекстПисьма = 
		НСтр("ru = 'Добрый день!
			 |
			 |Во вложении комплект документов для оформления перевода на дистанционную работу.
			 |Пожалуйста, распечатайте его, поставьте свою подпись в обозначенных местах и пришлите нам фотографию или скан-копию в ответ на это письмо.
			 |
			 |С уважением, Администрация.'");
	// АПК:374-вкл

	Команда.ПечатныеФормы = Новый Массив;
	
	//Команда.ПечатныеФормы.Вставить(0, РассылкаДокументовКлиентСервер.НоваяПечатнаяФорма());
	Команда.ПечатныеФормы[0].ОбработчикПолученияДанных =
		"Обработки.ПечатьДокументовДляПереводаНаДистанционнуюРаботу.ТаблицаДанныхПечатиЗаявленияОПереводеНаДистанционнуюРаботу";
	Команда.ПечатныеФормы[0].Идентификатор = "ПФ_MXL_ЗаявлениеОПереводеНаДистанционнуюРаботу";
	ДобавитьУсловиеВидимостиКоманды(Команда, Истина);
	
	Если Не ЭтоКадровыйПеревод Тогда
		Возврат;
	КонецЕсли;
	
	//Команда.ПечатныеФормы.Вставить(1, РассылкаДокументовКлиентСервер.НоваяПечатнаяФорма());
	Команда.ПечатныеФормы[1].ОбработчикПолученияДанных =
		"Обработки.ПечатьДокументовДляПереводаНаДистанционнуюРаботу.ТаблицаДанныхПечатиДопСоглашенияПриПереводеДистанционнуюРаботу";
	Команда.ПечатныеФормы[1].Идентификатор = "ПФ_MXL_ДопСоглашениеКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу";
	ДобавитьУсловиеВидимостиКоманды(Команда, Истина, "ИзменитьДистанционнуюРаботу");
	
КонецПроцедуры

#КонецОбласти

Процедура ДобавитьПолеЗапроса(Схема, ИмяВТ, ЗначениеПоля, Псевдоним)
	
	Для НомерЗапроса = 1 По Схема.ПакетЗапросов.Количество() Цикл	
		ЗапросПакета = Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество() - НомерЗапроса];
		Если ТипЗнч(ЗапросПакета) = Тип("ЗапросВыбораСхемыЗапроса") Тогда			
			Если ЗапросПакета.ТаблицаДляПомещения = ИмяВТ Тогда
				ЗапросПакета.Операторы[0].ВыбираемыеПоля.Добавить(ЗначениеПоля);
				ЗапросПакета.Колонки[ЗапросПакета.Колонки.Количество()-1].Псевдоним = Псевдоним;		
				Прервать;
			КонецЕсли;			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
